In [2]:
import pandas as pd
data = {'col_1' : [3, 2, 1, 0], 'col_2' : ['a', 'b', 'c', 'd']}
pd.DataFrame(data)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

# 2. Creating a DataFrame

## 2.1 Creating a DataFrame

In [4]:
import pandas as pd
s = pd.Series([1.0, 2.0, 3.0], index = ['a', 'b', 'c'])
s2 = pd.Series([1.0, 2.0, 3.0, 4.0], index = ['a', 'b', 'c', 'd'])

data = {'one' : s, 'two' : s2}

pd.DataFrame(data)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

## 2.2 Setting the Name of Rows (Index) and Columns

In [5]:
import pandas as pd
d = {'col1' : [1, 2], 'col2' : [3, 4]}
df = pd.DataFrame(data = d)
print(df)

df.index = ['new index0', 'new index1']
print(df)

df.columns = ['new_col1', 'new_col2']
print(df)

   col1  col2
0     1     3
1     2     4
            col1  col2
new index0     1     3
new index1     2     4
            new_col1  new_col2
new index0         1         3
new index1         2         4

In [7]:
import pandas as pd
d = {'col1' : [1, 2], 'col2' : [3, 4]}
df = pd.DataFrame(data = d)
print(df)

df.rename(index = {0 : 'new index0'})

   col1  col2
0     1     3
1     2     4

            col1  col2
new index0     1     3
1              2     4

In [8]:
df.rename(columns = {'col2' : 'new col2'})

   col1  new col2
0     1         3
1     2         4

In [9]:
import pandas as pd
d = {'col1' : [1, 2], 'col2' : [3, 4]}
df = pd.DataFrame(data = d)
df.rename(index = {0 : 'new index0'}, inplace = True)
df.rename(columns = {'col2' : 'new col2'})

            col1  new col2
new index0     1         3
1              2         4

In [10]:
import pandas as pd
s = pd.Series([1.0, 2.0, 3.0], index = ['a', 'b', 'c'])
s2 = pd.Series([1.0, 2.0, 3.0, 4.0], index = ['a', 'b', 'c', 'd'])

dic_data = {'one' : s, 'two' : s2}

pd.DataFrame.from_dict(dic_data, orient = 'columns')

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [11]:
pd.DataFrame.from_dict(dic_data, orient = 'index')

       a    b    c    d
one  1.0  2.0  3.0  NaN
two  1.0  2.0  3.0  4.0

In [12]:
data = {'row_1' : [3, 2, 1, 0], 'row_2' : ['a', 'b', 'c', 'd']}
pd.DataFrame.from_dict(data, orient = 'index', columns = ['A', 'B', 'C', 'D'])

       A  B  C  D
row_1  3  2  1  0
row_2  a  b  c  d

# 3. Converting Various Data Objects to DataFrame

## 3.1 The pandas I/O API

## 3.2 File Paths

## 3.3 dataframe.head()' for Data Inspection

In [13]:
import pandas as pd

df = pd.DataFrame({'animal' : ['alligator', 'bee', 'falcon', 'lion',
                              'monkey', 'parrot', 'shark', 'whale', 'zebra']})

df

      animal
0  alligator
1        bee
2     falcon
3       lion
4     monkey
5     parrot
6      shark
7      whale
8      zebra

In [14]:
df.head()

      animal
0  alligator
1        bee
2     falcon
3       lion
4     monkey

In [15]:
df.head(3)

      animal
0  alligator
1        bee
2     falcon

In [16]:
df.shape

(9, 1)

In [17]:
len(df)

9

In [18]:
df.columns

Index(['animal'], dtype='object')

In [19]:
df.values

array([['alligator'],
       ['bee'],
       ['falcon'],
       ['lion'],
       ['monkey'],
       ['parrot'],
       ['shark'],
       ['whale'],
       ['zebra']], dtype=object)

# 4. Converting CSV Files to DataFrame

## 4.1 Reading Files and Creating DataFrame Objects